Enums/ВерсииФорматовОбменаЧестногоЗнака.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВерсииФорматовОбменаЧестногоЗнака</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>v3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>v4</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НастройкаОбменаМаркировкиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НастройкаОбменаМаркировкиТоваров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСУЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОжидания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФорматаОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииФорматовОбменаЧестногоЗнака</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСУЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСУЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАвторизацияИдентификаторомСУЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТестовыйКонтур</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИспользоватьTrueAPI</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДляККТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокУстройств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКомпании</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьТокен</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСоединения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбменССистемойМаркировкиПовтИсп/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Получение параметров для формирования запроса в личный кабинет Честного знака
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации - Организация, для которой выполняется получение параметров
// 
// Возвращаемое значение:
//  Структура - Содержит информурмацию по организации
//
Функция ПараметрыЗапроса(Организация = Неопределено) Экспорт
	
	// Заполним по умолчанию
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("АдресКонтура", "ismp.crpt.ru");
	ПараметрыЗапроса.Вставить("ВерсияФорматаОбмена", "v3");
	ПараметрыЗапроса.Вставить("Порт", 443);
	ПараметрыЗапроса.Вставить("ВремяОжидания", 60);
	ПараметрыЗапроса.Вставить("ЗащищенноеСоединение", Истина);
	ПараметрыЗапроса.Вставить("СписокУстройств", Новый ТаблицаЗначений);
	ПараметрыЗапроса.Вставить("Сертификат", Справочники.СертификатыКлючейЭлектроннойПодписиИШифрования.ПустаяСсылка());
	ПараметрыЗапроса.Вставить("omsId", "");
	ПараметрыЗапроса.Вставить("АдресСУЗ", "suz2.crpt.ru");
	ПараметрыЗапроса.Вставить("ПортСУЗ", 443);
	ПараметрыЗапроса.Вставить("ТокенДляККТ", "");
	ПараметрыЗапроса.Вставить("АдресCDNПлощадок", "");
	ПараметрыЗапроса.Вставить("Адрес", ПараметрыЗапроса.АдресКонтура);
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		ЗначенияПоОрганизации = НастройкаПодключения(Организация);
		
		Если ЗначенияПоОрганизации <> Неопределено Тогда
			ПараметрыЗапроса.omsId = ЗначенияПоОрганизации.omsId;
			ПараметрыЗапроса.АдресКонтура = ЗначенияПоОрганизации.Адрес;
			ПараметрыЗапроса.ВерсияФорматаОбмена = 
					Перечисления.ВерсииФорматовОбменаЧестногоЗнака.ЗначениеВерсииФормата(ЗначенияПоОрганизации.ВерсияФорматаОбмена);
			ПараметрыЗапроса.Порт = ЗначенияПоОрганизации.Порт;
			ПараметрыЗапроса.ВремяОжидания = ЗначенияПоОрганизации.ВремяОжидания;
			ПараметрыЗапроса.ЗащищенноеСоединение = ЗначенияПоОрганизации.ЗащищенноеСоединение;
			ПараметрыЗапроса.СписокУстройств = ЗначенияПоОрганизации.СписокУстройств;
			ПараметрыЗапроса.Сертификат = ЗначенияПоОрганизации.Сертификат;
			ПараметрыЗапроса.АдресСУЗ = ЗначенияПоОрганизации.АдресСУЗ;
			ПараметрыЗапроса.ПортСУЗ = ЗначенияПоОрганизации.ПортСУЗ;
			ПараметрыЗапроса.ТокенДляККТ = ЗначенияПоОрганизации.ТокенДляККТ;
			Если ЗначенияПоОрганизации.ТестовыйКонтур Тогда
				ПараметрыЗапроса.АдресCDNПлощадок = ПараметрыЗапроса.АдресКонтура;
			Иначе
				ПараметрыЗапроса.АдресCDNПлощадок = "cdn.crpt.ru";
			КонецЕсли;
			ПараметрыЗапроса.Адрес = ПараметрыЗапроса.АдресКонтура;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПараметрыЗапроса;
	
КонецФункции // ПараметрыЗапроса()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получение настроек подключения из справочника настроек
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации - Организация, для которой выполняется получение параметров
// 
// Возвращаемое значение:
//  Структура - Указанные параметры для данной организации
//
Функция НастройкаПодключения(Организация)
	
	Результат = Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	НастройкаОбменаМаркировкиТоваров.ИдентификаторСУЗ КАК omsId,
	               |	НастройкаОбменаМаркировкиТоваров.Адрес КАК Адрес,
	               |	НастройкаОбменаМаркировкиТоваров.Порт КАК Порт,
	               |	НастройкаОбменаМаркировкиТоваров.ВремяОжидания КАК ВремяОжидания,
	               |	НастройкаОбменаМаркировкиТоваров.ВерсияФорматаОбмена КАК ВерсияФорматаОбмена,
	               |	НастройкаОбменаМаркировкиТоваров.ЗащищенноеСоединение КАК ЗащищенноеСоединение,
	               |	НастройкаОбменаМаркировкиТоваров.ТестовыйКонтур КАК ТестовыйКонтур,
	               |	НастройкаОбменаМаркировкиТоваров.АдресСУЗ КАК АдресСУЗ,
	               |	НастройкаОбменаМаркировкиТоваров.ПортСУЗ КАК ПортСУЗ,
	               |	НастройкаОбменаМаркировкиТоваров.Сертификат КАК Сертификат,
	               |	НастройкаОбменаМаркировкиТоваров.ТокенДляККТ КАК ТокенДляККТ,
	               |	НастройкаОбменаМаркировкиТоваров.СписокУстройств.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		ПодразделениеКомпании КАК ПодразделениеКомпании,
	               |		ИдентификаторСоединения КАК ИдентификаторСоединения
	               |	) КАК СписокУстройств
	               |ИЗ
	               |	Справочник.НастройкаОбменаМаркировкиТоваров КАК НастройкаОбменаМаркировкиТоваров
	               |ГДЕ
	               |	НастройкаОбменаМаркировкиТоваров.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Новый Структура();
		Результат.Вставить("Адрес");
		Результат.Вставить("ВерсияФорматаОбмена");
		Результат.Вставить("Порт");
		Результат.Вставить("ВремяОжидания");
		Результат.Вставить("ЗащищенноеСоединение");
		Результат.Вставить("Сертификат");
		Результат.Вставить("omsId");
		Результат.Вставить("АдресСУЗ");
		Результат.Вставить("ПортСУЗ");
		Результат.Вставить("ТокенДляККТ");
		Результат.Вставить("ТестовыйКонтур");
		
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
		Результат.Вставить("СписокУстройств", Выборка.СписокУстройств.Выгрузить());
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // НастройкаПодключения()

#КонецОбласти
